update the README f
